web/app/controllers/tracker_controller.rb

    def create

        if params[:latitude] > 0 and params[:longitude] > 0
            @tracker = Tracker.new(lat: params[:latitude], lon: params[:longitude])

            @tracker.save
---
INSERT INTO "trackers" ("lat", "lon", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["lat", 53.654762], ["lon", 23.801329], ["created_at", "2017-10-08 11:08:16.998931"], ["updated_at", "2017-10-08 11:08:16.998931"]]